#define Y_LED 0 //หลอดแอลอดีีสีเหลือง ต่อกบั GPIO0
#define R_LED 15 //หลอดแอลอดีีสแดง ี ตอก่ ับ GPIO15
#define SW1 4 //ดิปสวตชิ ์บิตที่ 1 ต่อกับ GPIO4
void setup() //ฟังก์ชันสาหร ํ บการต ั งคั้ ่าเรมติ่ ้นใช้งานบอร์ด NodeMCU
{
  pinMode(Y_LED, OUTPUT); //ตั้งให้ GPIO16 ซึ่งต่อกับแอลอดีีสเหล ี ืองทาหน ํ าท้ ี่เอาต์พุต
  pinMode(R_LED, OUTPUT); //ตงใหั้ ้ GPIO5 ซึ่งต่อกับแอลอดีีสแดงท ี ําหนาท้ ี่เอาตพ์ ุต
  pinMode(SW1, INPUT); //ตงใหั้ ้ GPIO4 ซึ่งต่อกับดิปสวิตช์บตทิ ี่ 1 ทําหนาท้ ี่เปนอ็ ินพุต
}
void loop() //ฟังก์ชันซึ่งสั่งใหต้ัวประมวลผลวนซ้ําไม่รจบู้
{
  bool s1 = digitalRead(SW1); //รบคั ่าจากดิปสวตชิ ์บิตที่ 1

  if (s1) //หากคาจากสว ่ ิตช์เป็นตรรกะสงู
    digitalWrite(Y_LED, HIGH); //สงใหั่ ้หลอดแอลอีดีสีเหลืองติด
  else //แต่ถ้าคาจากด ่ ปสว ิ ิตช์เป็นตรรกะตา่ํ
    digitalWrite(Y_LED, LOW); //สงใหั่ ้หลอดแอลอีดีสีเหลืองดับ
  digitalWrite(R_LED, HIGH); //สงใหั่ ้หลอดแอลอีดีสีแดงติด
  delay(250); //หน่วงเวลา 250 มิลลวิินาที
  digitalWrite(R_LED, LOW); //สงใหั่ ้หลอดแอลอีดีสีแดงดับ
  delay(250); //หน่วงเวลา 250 มิลลวิินาที
}
